<template>
  <div class="terms">
    <v-icon
      class="mdi mdi-backburger"
      color="primary"
      @click="$router.push('/authentication')"
    />
    <h2>Умови використання сайту</h2>
    <p>
      Увага! Перед переглядом цього сайту уважно прочитайте ці умови. Якщо ви не
      не згодні з цими умовами, не використовуйте цей сайт.
    </p>

    <h3>Використання сайту</h3>
    <p>
      Сайт ROZETKA (далі – «Розетка») дає змогу вам переглядати та завантажувати
      матеріали цього сайту (далі – «Сайт») тільки для особистого некомерційного
      використання, за умови збереження вами всієї інформації про авторське
      право та інших відомостей про право власності, що містяться у вихідних
      матеріалах і будь-яких їхніх копіях. Заборонено змінювати матеріали цього
      Сайту, а також поширювати або демонструвати їх у будь-якому вигляді або
      використовувати їх будь-яким іншим чином для суспільних чи комерційних
      цілей. Будь-яке використання цих матеріалів на інших сайтах або в
      комп'ютерних мережах заборонено.
    </p>

    <h3>Відмова від відповідальності</h3>
    <p>
      Матеріали та послуги цього сайту надаються «як є» без жодних гарантій.
      Розетка не гарантує точності та повноти матеріалів, програм і послуг, що
      надаються на цьому Сайті. Розетка в будь-який час без повідомлення може
      вносити зміни до матеріалів і послуг, що надаються на цьому Сайті, а також
      до згаданих у них продуктів і цін. У разі якщо матеріали та послуги на
      цьому Сайті застаріють, Розетка не зобов'язана оновлювати їх. Розетка за
      жодних обставин не несе відповідальності за будь-які збитки (включно з,
      але не обмежуючись збитком від втрати прибутку, даних або від переривання
      ділової активності), що виникли внаслідок використання, неможливості
      використання або результатів використання цього сайту.
    </p>

    <h3>Реєстрація на сайті</h3>
    <p>
      Реєструючись на Сайті, ви погоджуєтеся надати достовірну та точну
      інформацію про себе і свої контактні дані.
    </p>

    <p>
      У результаті реєстрації ви отримуєте логін і пароль, за безпеку яких ви
      несете відповідальність. Ви також несете відповідальність за всі дії під
      вашим логіном і паролем на Сайті. У разі втрати реєстраційних даних ви
      зобов'язуєтеся повідомити нам про це. Зворотний зв'язок і коментарі
    </p>
    <p>
      Звертаючись до нас або залишаючи коментарі на сайті, ви несете
      відповідальність, що це повідомлення не є незаконним, шкідливим,
      загрозливим, наклепницьким, суперечить моральним нормам, порушує авторські
      права, пропагує ненависть і/або дискримінацію людей за расовою, етнічною,
      статевою, релігійною, соціальною ознаками, містить образи на адресу
      конкретних осіб або організацій, а також будь-яким іншим чином порушує
      чинне законодавство України. Ви погоджуєтеся, що будь-яке ваше
      повідомлення Розетка може видаляти без вашої на те згоди, а також
      безоплатно використовувати на власний розсуд. Розетка не несе
      відповідальності за будь-яку інформацію, розміщену користувачами Сайту.
    </p>

    <h3>Використання персональних даних</h3>
    <p>
      Ми використовуємо різні технології для збирання та зберігання інформації,
      коли ви відвідуєте сайт Розетка (докладніше про захист і обробку
      персональних даних ). Це може включати в себе запис одного або декількох
      куки або анонімних ідентифікаторів. Ми також використовуємо куки й
      анонімні ідентифікатори, коли ви взаємодієте з послугами, запропонованими
      нашими партнерами, як-от рекламні послуги, наприклад, що можуть з'явитися
      на інших сайтах.
    </p>

    <h3>Повідомлення і розсилки</h3>
    <p>
      Розетка може направляти вам повідомлення у відповідь на повідомлення
      (запити та скарги), направлені вами через форму зворотного зв’язку та в
      процесі замовлення товарів та/або послуг, при управлінні замовленнями,
      видачі товарів, наданні послуг. Розетка здійснює надсилання повідомлень у
      вигляді email-листів, повідомлень у Viber, SMS-повідомлень, сповіщень у
      мобільному додатку, сповіщень у веббраузері. Ви можете керувати процедурою
      направлення повідомлень через відповідні налаштування на Сайті
      (https://my.rozetka.com.ua/ua/profile/subscribes/).
    </p>
  </div>
</template>
